import React from 'react';
import { useTranslation } from 'react-i18next';
import { Header, Segment } from 'semantic-ui-react';

export default function AboutPage() {
    const { t } = useTranslation();
    let contents = `Ласкаво просимо до нашого сайту-агрегатора закладів вищої освіти, місця де зібрана уся інформація про найкращі ЗВО України. Наша платформа розроблена, щоб надавати вичерпну інформацію про різні ЗВО, допомагаючи студентам приймати зважені рішення щодо їхнього навчання.

На нашому сайті ми прагнемо об’єднати інформацію з багатьох джерел, включаючи офіційні веб-сайти університетів, рейтинги, відгуки та відгуки студентів, щоб забезпечити цілісне уявлення про кожен заклад. Наша команда дослідників невпинно працює над збором найточнішої та найновішої інформації про університети, тому вам не доведеться витрачати години на самостійне дослідження.

Ми розуміємо, що вибір ЗВО є рішенням, яке може мати значний вплив на вашу майбутню кар'єру та особистий ріст. Тому ми прагнемо створити зручну платформу, яка пропонує відповідну інформацію та інструменти, які допоможуть вам зробити правильний вибір.

На нашому сайті є інтуїтивно зрозуміла функція пошуку, яка дозволяє фільтрувати університети за різними критеріями, такими як місце розташування, спеціальність, плата за навчання тощо. Ви також можете порівняти університети та спеціальності пліч-о-пліч, щоб прийняти зважене рішення.

Наша мета - надання неупередженої інформації про різні навчальні заклади, надаючи студентам можливість вибрати найкращий академічний шлях для свого майбутнього. Незалежно від того, чи є ви учнем середньої школи, який бажає дослідити свої можливості, чи аспірантом, який прагне просунутися по кар’єрі, у нас є все, що вам потрібно, щоб прийняти обґрунтоване рішення щодо ваших навчальних занять.

Дякуємо, що обрали нашу платформу, як основний ресурс для отримання інформації про університети.`
    return (
        <Segment basic style={{width: '60rem', margin: '0 auto', padding: '6rem 0'}}>
            <div style={{fontSize: '4rem', fontWeight: 800, fontFamily: 'fantasy',color: '#33333a', textAlign: 'center'}}>
                {t('The best choice from here')}
            </div>
            <div style={{fontSize: '2rem', fontWeight: 800, padding: '2rem 0', color: '#888', textAlign: 'center'}}>
                {t('The platform for institutions search')}
            </div>
            <div style={{width: '100%'}}>
                <pre style={{ fontFamily: 'inherit', whiteSpace: 'pre-wrap' }}>
                    {contents}
                </pre>
            </div>
        </Segment>
    )
}